HuusarnProfessional/agv-motion-mcu-firmware/targets/stm32g474re_agv/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define user_button___GPIO_Input_Pin GPIO_PIN_13
#define user_button___GPIO_Input_GPIO_Port GPIOC
#define RCC_OSC32_IN_Pin GPIO_PIN_14
#define RCC_OSC32_IN_GPIO_Port GPIOC
#define RCC_OSC32_OUT_Pin GPIO_PIN_15
#define RCC_OSC32_OUT_GPIO_Port GPIOC
#define hc_f_echo_GPIO_INPUT_Pin GPIO_PIN_0
#define hc_f_echo_GPIO_INPUT_GPIO_Port GPIOF
#define hc_f_trig_GPIO_OUTPUT_Pin GPIO_PIN_1
#define hc_f_trig_GPIO_OUTPUT_GPIO_Port GPIOF
#define pwm_l1_a___TIM1_CH1_Pin GPIO_PIN_0
#define pwm_l1_a___TIM1_CH1_GPIO_Port GPIOC
#define pwm_l1_b___TIM1_CH2_Pin GPIO_PIN_1
#define pwm_l1_b___TIM1_CH2_GPIO_Port GPIOC
#define pwm_l2_a___TIM1_CH3_Pin GPIO_PIN_2
#define pwm_l2_a___TIM1_CH3_GPIO_Port GPIOC
#define pwm_l2_b___TIM1_CH4_Pin GPIO_PIN_3
#define pwm_l2_b___TIM1_CH4_GPIO_Port GPIOC
#define encoder_l1___TIM2_CH1_Pin GPIO_PIN_0
#define encoder_l1___TIM2_CH1_GPIO_Port GPIOA
#define encoder_l2___TIM2_CH2_Pin GPIO_PIN_1
#define encoder_l2___TIM2_CH2_GPIO_Port GPIOA
#define LPUART1_TX_Pin GPIO_PIN_2
#define LPUART1_TX_GPIO_Port GPIOA
#define LPUART1_RX_Pin GPIO_PIN_3
#define LPUART1_RX_GPIO_Port GPIOA
#define imu_spi_scl___SPI1_SCK_Pin GPIO_PIN_5
#define imu_spi_scl___SPI1_SCK_GPIO_Port GPIOA
#define imu_spi_sdo_ag___SPI1_MISO_Pin GPIO_PIN_6
#define imu_spi_sdo_ag___SPI1_MISO_GPIO_Port GPIOA
#define imu_spi_sda___SPI1_MOSI_Pin GPIO_PIN_7
#define imu_spi_sda___SPI1_MOSI_GPIO_Port GPIOA
#define stm_to_esp_uart___USART1_TX_Pin GPIO_PIN_4
#define stm_to_esp_uart___USART1_TX_GPIO_Port GPIOC
#define esp_to_stm_uart___USART1_RX_Pin GPIO_PIN_5
#define esp_to_stm_uart___USART1_RX_GPIO_Port GPIOC
#define encoder_r1___TIM2_CH3_Pin GPIO_PIN_10
#define encoder_r1___TIM2_CH3_GPIO_Port GPIOB
#define encoder_r2___TIM2_CH4_Pin GPIO_PIN_11
#define encoder_r2___TIM2_CH4_GPIO_Port GPIOB
#define supply_sens___ADC1_IN11_Pin GPIO_PIN_12
#define supply_sens___ADC1_IN11_GPIO_Port GPIOB
#define pwm_r2_a___TIM3_CH3_Pin GPIO_PIN_8
#define pwm_r2_a___TIM3_CH3_GPIO_Port GPIOC
#define pwm_r2_b___TIM3_CH4_Pin GPIO_PIN_9
#define pwm_r2_b___TIM3_CH4_GPIO_Port GPIOC
#define T_SWDIO_Pin GPIO_PIN_13
#define T_SWDIO_GPIO_Port GPIOA
#define T_SWCLK_Pin GPIO_PIN_14
#define T_SWCLK_GPIO_Port GPIOA
#define hc_b_trig___GPIO_Output_Pin GPIO_PIN_10
#define hc_b_trig___GPIO_Output_GPIO_Port GPIOC
#define hc_b_echo_GPIO_Input_Pin GPIO_PIN_11
#define hc_b_echo_GPIO_Input_GPIO_Port GPIOC
#define led_01___GPIO_Output_Pin GPIO_PIN_2
#define led_01___GPIO_Output_GPIO_Port GPIOD
#define T_SWO_Pin GPIO_PIN_3
#define T_SWO_GPIO_Port GPIOB
#define pwm_r1_a___TIM3_CH1_Pin GPIO_PIN_4
#define pwm_r1_a___TIM3_CH1_GPIO_Port GPIOB
#define pwm_r1_b___TIM3_CH2_Pin GPIO_PIN_5
#define pwm_r1_b___TIM3_CH2_GPIO_Port GPIOB
#define imu_spi_cs_ag___GPIO_Output_Pin GPIO_PIN_8
#define imu_spi_cs_ag___GPIO_Output_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
